<script setup>

</script>

<template>
  <div class="functions">
    <div>
      <h2>Получение изображений</h2>
      <p>При открытии приложения в <span>ленте</span> будут показаны случайные изображения из <a target="_blank" href="https://unsplash.com/">Unsplash</a>. Эти
        изображения могут быть на <span>любую тему</span>: природа, путешествия, еда, животные, абстракции и многое другое.
        Вы можете наслаждаться красотой и разнообразием каждого изображения, оно будет меняться при каждом вашем визите.
        Вы можете искать изображения по ключевым словам: используйте функцию поиска, чтобы найти
        изображения из определенной категории.
      </p>
    </div>

    <div>
      <h2>Поиск изображений</h2>
      <p><span>Функция поиска</span> позволяет вам найти изображения по ключевым словам или фразам, которые вас интересуют.
        Для этого вам нужно просто ввести интересующее вас слово или фразу в специальную поисковую строку в
        приложении и нажать клавишу Enter. После этого приложение покажет вам изображения,
        соответствующие <span>вашему запросу</span>.
      </p>
    </div>

    <div>
      <h2>Лайк изображений</h2>
      <p>
        Если вам понравилось изображение, вы можете <span>поставить лайк</span>, нажав на значок сердечка на изображении.
        Это поможет вам сохранить изображение в качестве избранного, чтобы вы могли легко найти его в дальнейшем.
        Понравившиеся изображения будут автоматически добавлены в <span>ваш список избранного</span>, который вы можете
        просматривать и редактировать в любое время. Это удобно, если вы хотите сохранить изображения для
        просмотра позже или поделиться ими с друзьями.
      </p>
    </div>

    <div>
      <h2>Избранное</h2>
      <p>
        Вы можете просмотреть все изображения, которые вам понравились, на <span>странице "Избранное"</span>.
        Если вдруг вы передумали и решили удалить какое-то изображение из избранных, просто нажмите на значок
        сердечка снова. После этого изображение будет удалено из вашего списка избранных, но останется доступным
        в общем каталоге изображений.
      </p>
    </div>
  </div>
</template>

<style scoped>
.functions h2 {
  margin-bottom: 30px;
  font-size: 30px;
  font-weight: 600;
  color: #EA526F;
}

.functions p {
  padding-bottom: 30px;
  font-size: 18px;
}

a {
  text-decoration: none;
  color: #2c3e50;
}

a:hover {
  color: #EA526F;
}

span {
  font-weight: 600;
  color: #EA526F;
}
</style>